In [40]:
import pandas as pd
import numpy as np
import random
import string

* # series is just a single column of data

In [41]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [42]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [43]:
index1 = [alphalist[i] for i in range (10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [44]:
series1 = pd.Series(data=data1,index=index1)
series1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [45]:
dico = {k:v for k,v in zip(index1, data1)}

In [46]:
series2 = pd.Series(dico)
series2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [47]:
df = pd.DataFrame(np.random.randn(5,5), index='A/B/C/D/E'.split('/'), columns='V/W/X/Y/Z'.split('/'))
df

          V         W         X         Y         Z
A -1.050603 -0.345517  1.069109 -0.311361 -0.905226
B  0.079431 -0.831307 -0.307917 -0.234716 -0.907832
C -0.991640 -0.270484 -0.757083  1.053924  1.069135
D -0.410154  0.579699 -1.764106  0.940385 -1.119956
E -1.051572  0.948455  0.624013  0.683468  0.166122

In [48]:
# how to select columns
df[['V','X']]

          V         X
A -1.050603  1.069109
B  0.079431 -0.307917
C -0.991640 -0.757083
D -0.410154 -1.764106
E -1.051572  0.624013

In [49]:
df[['W','Y']]

          W         Y
A -0.345517 -0.311361
B -0.831307 -0.234716
C -0.270484  1.053924
D  0.579699  0.940385
E  0.948455  0.683468

In [50]:
# use iloc to select a particular row
df.iloc[0]

V   -1.050603
W   -0.345517
X    1.069109
Y   -0.311361
Z   -0.905226
Name: A, dtype: float64

In [51]:
df.loc['B']['V']

0.07943124887682525

In [52]:
df[df['W']>0]

          V         W         X         Y         Z
D -0.410154  0.579699 -1.764106  0.940385 -1.119956
E -1.051572  0.948455  0.624013  0.683468  0.166122

In [53]:
# adding new column to the data frame
df['U']  = df['V']+df['Z'] 
df

          V         W         X         Y         Z         U
A -1.050603 -0.345517  1.069109 -0.311361 -0.905226 -1.955829
B  0.079431 -0.831307 -0.307917 -0.234716 -0.907832 -0.828400
C -0.991640 -0.270484 -0.757083  1.053924  1.069135  0.077495
D -0.410154  0.579699 -1.764106  0.940385 -1.119956 -1.530110
E -1.051572  0.948455  0.624013  0.683468  0.166122 -0.885450

In [54]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
C -0.991640 -0.270484 -0.757083  1.053924  1.069135  0.077495
E -1.051572  0.948455  0.624013  0.683468  0.166122 -0.885450

In [55]:
df.iloc[0]

V   -1.050603
W   -0.345517
X    1.069109
Y   -0.311361
Z   -0.905226
U   -1.955829
Name: A, dtype: float64

In [56]:
df.loc['A']

V   -1.050603
W   -0.345517
X    1.069109
Y   -0.311361
Z   -0.905226
U   -1.955829
Name: A, dtype: float64

In [57]:
df[['W','Y']]

          W         Y
A -0.345517 -0.311361
B -0.831307 -0.234716
C -0.270484  1.053924
D  0.579699  0.940385
E  0.948455  0.683468

In [58]:
df.iloc[1]['X']

-0.30791738662025353

In [59]:
df.iloc[3]['Z']

-1.119955535355841

In [60]:
df.iloc[3,1:3]

W    0.579699
X   -1.764106
Name: D, dtype: float64

In [61]:
df.loc['D'][['X','Z']]

X   -1.764106
Z   -1.119956
Name: D, dtype: float64

In [62]:
df[['X','Z']].loc['D']

X   -1.764106
Z   -1.119956
Name: D, dtype: float64

In [63]:
# this will return the first 5 rows of the data frame
df.head()

          V         W         X         Y         Z         U
A -1.050603 -0.345517  1.069109 -0.311361 -0.905226 -1.955829
B  0.079431 -0.831307 -0.307917 -0.234716 -0.907832 -0.828400
C -0.991640 -0.270484 -0.757083  1.053924  1.069135  0.077495
D -0.410154  0.579699 -1.764106  0.940385 -1.119956 -1.530110
E -1.051572  0.948455  0.624013  0.683468  0.166122 -0.885450

In [64]:
# this will return the last 5 rows of the data frame
df.tail()

          V         W         X         Y         Z         U
A -1.050603 -0.345517  1.069109 -0.311361 -0.905226 -1.955829
B  0.079431 -0.831307 -0.307917 -0.234716 -0.907832 -0.828400
C -0.991640 -0.270484 -0.757083  1.053924  1.069135  0.077495
D -0.410154  0.579699 -1.764106  0.940385 -1.119956 -1.530110
E -1.051572  0.948455  0.624013  0.683468  0.166122 -0.885450

In [65]:
df.tail(2)

          V         W         X         Y         Z        U
D -0.410154  0.579699 -1.764106  0.940385 -1.119956 -1.53011
E -1.051572  0.948455  0.624013  0.683468  0.166122 -0.88545

* # Concatinate 
    * #### combine 2 or 3 data frames

In [66]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3']}, index =[0,1,2,3])

In [67]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7']}, index =[0,1,2,3])

In [68]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [69]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

* # Merging and joining data frames

In [85]:
left = pd.DataFrame({'A': ['A0','A1','A2'],
                   'B': ['A0','B1','B2']},
                    index=['K0','K1','K2'])

right = pd.DataFrame({'C': ['C0','C1','C2'],
                    'D': ['D0','D1','D2']},
                    index=['K0','K2','K3'])

In [86]:
left.join(right)

     A   B    C    D
K0  A0  A0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [87]:
display(left,right)

     A   B
K0  A0  A0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [90]:
left = pd.DataFrame({'key1': ['K0','K1','K2','K3'],
                     'key2': ['K0','K1','K2','K3'],
                     'A': ['A0','A1','A2','A3'],
                   'B': ['A0','B1','B2','B3']})

right = pd.DataFrame({'key1': ['K0','K1','K2','K3'],
                     'key2': ['K0','K1','K2','K3'],
                     'C': ['C0','C1','C2','C3'],
                   'D': ['D0','D1','D2','D3']})

In [92]:
pd.merge(left, right)

  key1 key2   A   B   C   D
0   K0   K0  A0  A0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2
3   K3   K3  A3  B3  C3  D3